{
  "cours": [
    {
      "id": 1,
      "titre": "Bases de données 1 : Concepts de base",
      "module": "TI503N-2526PSA01",
      "image": "database.png",
      "intervenant": "Lena TREBAUL",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Apprendre à concevoir, structurer et exploiter efficacement une base de données relationnelle répondant à des besoins concrets.",
      "description_longue": "Ce cours introduit les fondements des bases de données relationnelles. Les étudiants apprennent à analyser un besoin métier, à concevoir une base de données adaptée et à la structurer de manière cohérente. Le module couvre la modélisation conceptuelle (MERISE ou UML), la modélisation logique et physique, ainsi que les règles de normalisation permettant d’éviter les redondances et incohérences. Une attention particulière est portée à l’écriture de requêtes SQL afin d’interroger, manipuler et exploiter les données dans des cas pratiques proches du monde professionnel."
    },
    {
      "id": 2,
      "titre": "Programmation Web 1 : HTML, CSS, JS",
      "module": "TI504N-2526PSA01",
      "image": "web.png",
      "intervenant": "Mohamed HAMIDI",
      "image_prof": "../img/prof/mohamed_hamidi.jpg",
      "description_courte": "Découvrir et maîtriser les bases du développement web pour créer des sites modernes, interactifs et responsives.",
      "description_longue": "Ce module constitue une introduction complète au développement web. Les étudiants découvrent le fonctionnement du Web et apprennent à créer des pages structurées avec HTML5, mises en forme avec CSS3 et rendues interactives grâce à JavaScript. Le cours aborde également les notions de responsive design, d’accessibilité et de bonnes pratiques de développement front-end. À travers des exercices pratiques et des mini-projets, les étudiants acquièrent les bases nécessaires pour concevoir des interfaces web dynamiques et professionnelles."
    },
    {
      "id": 3,
      "titre": "Java 1 : Fondamentaux de la POO",
      "module": "TI505N-2526PSA01",
      "image": "java.png",
      "intervenant": "Cherifa BEN KHELIL",
      "image_prof": "../img/prof/cherifa_benkheli.jpg",
      "description_courte": "Comprendre et appliquer les principes fondamentaux de la programmation orientée objet avec Java.",
      "description_longue": "Ce cours permet aux étudiants de découvrir le langage Java et les concepts essentiels de la programmation orientée objet. Ils apprennent à créer et manipuler des classes et des objets, à utiliser l’héritage, l’encapsulation et le polymorphisme, ainsi qu’à structurer correctement un programme. Le module met l’accent sur la rigueur du code, la lisibilité et les bonnes pratiques. Des travaux pratiques permettent de développer des applications simples tout en consolidant la logique de programmation."
    },
    {
      "id": 4,
      "titre": "Introduction au système Linux",
      "module": "TI507N-2526PSA01",
      "image": "linux.png",
      "intervenant": "Yvan GUIFO",
      "image_prof": "../img/prof/yvan-guifo.jpg",
      "description_courte": "Découvrir le fonctionnement des systèmes GNU/Linux et apprendre à les utiliser efficacement.",
      "description_longue": "Ce cours propose une introduction complète aux systèmes d’exploitation GNU/Linux. Les étudiants découvrent les principes fondamentaux des systèmes d’exploitation, la philosophie open source et l’organisation d’un système Linux. Le module aborde l’utilisation du terminal, la gestion des fichiers, des utilisateurs et des permissions, ainsi que les processus et les services. Des mises en pratique sur une distribution Linux permettent de développer une autonomie technique essentielle pour les métiers de l’informatique."
    },
    {
      "id": 5,
      "titre": "Les fondamentaux du Cloud Computing",
      "module": "TI609N-2526PSP01",
      "image": "cloud.png",
      "intervenant": "BEN KHELIL Cherifa",
      "image_prof": "../img/prof/cherifa_benkheli.jpg",
      "description_courte": "Comprendre les principes du cloud computing et ses usages dans les systèmes informatiques modernes.",
      "description_longue": "Ce cours introduit les concepts clés du cloud computing, aujourd’hui au cœur des infrastructures informatiques. Les étudiants découvrent les différents modèles de services (IaaS, PaaS, SaaS), les architectures cloud et les enjeux liés à la virtualisation. Le module aborde également les avantages, les limites et les problématiques de sécurité du cloud. À travers des exemples concrets, les étudiants comprennent comment les entreprises exploitent le cloud pour gagner en flexibilité, en performance et en scalabilité."
    },
    {
      "id": 6,
      "titre": "Introduction à la cybersécurité",
      "module": "TI530-2526PSA01",
      "image": "cyber.png",
      "intervenant": "Yaovi SOGLO",
      "image_prof": "../img/prof/yaovi_soglo.jpg",
      "description_courte": "Découvrir les bases de la cybersécurité et comprendre les menaces qui pèsent sur les systèmes informatiques.",
      "description_longue": "Ce cours offre une introduction aux enjeux majeurs de la cybersécurité. Les étudiants découvrent les principales menaces informatiques, telles que les attaques réseau, les malwares ou le phishing. Le module aborde également les notions de sécurité des systèmes, de protection des données et de gestion des accès. À travers des exemples concrets et des études de cas, les étudiants prennent conscience de l’importance de la sécurité dans les environnements numériques actuels."
    },
    {
      "id": 8,
      "titre": "Java Programming",
      "module": "TI505M-2526PSA01",
      "image": "java.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Apprendre à programmer en Java.",
      "description_longue": "Ce cours permet de développer des applications en Java en maîtrisant les bases du langage. Les étudiants travaillent sur la programmation orientée objet, la gestion de la mémoire et les bonnes pratiques de développement."
    },
    {
      "id": 9,
      "titre": "Object-Oriented Analysis & Design with UML",
      "module": "TI515M-2526PSA01",
      "image": "orienteobjet.jpg",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Modéliser un système avec UML.",
      "description_longue": "Ce cours apprend à analyser et concevoir des systèmes logiciels en utilisant UML. Les étudiants réalisent des diagrammes (cas d’utilisation, classes, séquences) pour structurer correctement une application."
    },
    {
      "id": 10,
      "titre": "Introduction to Machine Learning",
      "module": "TI508M-2526PSA01",
      "image": "machinelearning.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Découvrir les bases du machine learning.",
      "description_longue": "Ce cours introduit les principes du machine learning. Les étudiants découvrent les notions de données, d’apprentissage supervisé et non supervisé, ainsi que des exemples concrets d’applications."
    },
    {
      "id": 11,
      "titre": "Computer Architecture and Operating Systems",
      "module": "TI504M-2526PSA01",
      "image": "computerarchitecture.webp",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Comprendre le fonctionnement interne des ordinateurs.",
      "description_longue": "Ce cours explique l’architecture des ordinateurs et le rôle des systèmes d’exploitation. Les étudiants découvrent le processeur, la mémoire, la gestion des processus et des ressources."
    },
    {
      "id": 12,
      "titre": "Advanced Web Programming",
      "module": "TI510M-2526PSA01",
      "image": "web.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Approfondir le développement web.",
      "description_longue": "Ce cours approfondit les concepts du développement web. Les étudiants travaillent avec JavaScript avancé, des frameworks et des architectures modernes pour créer des applications web plus complexes."
    },
    {
      "id": 13,
      "titre": "Networks and Protocols",
      "module": "TI502M-2526PSA01",
      "image": "networkprotocol.jpg",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Comprendre les bases des réseaux informatiques.",
      "description_longue": "Ce cours présente les fondamentaux des réseaux et des protocoles de communication. Les étudiants découvrent TCP/IP, l’adressage IP et le fonctionnement des échanges de données."
    },
    {
      "id": 14,
      "titre": "Algorithmique et Programmation",
      "module": "TI500N-2526PSA01",
      "image": "algorithme.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Apprendre à résoudre des problèmes par le code.",
      "description_longue": "Ce cours initie les étudiants à l’algorithmique et à la programmation. Il permet d’apprendre à concevoir des algorithmes simples, à structurer un programme et à développer une logique informatique."
    },
    {
      "id": 15,
      "titre": "Numérique Durable",
      "module": "TI616-2526PSP01",
      "image": "greenit.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Comprendre l’impact environnemental du numérique.",
      "description_longue": "Ce cours sensibilise aux enjeux environnementaux liés au numérique. Les étudiants découvrent les principes de la Green IT, l’optimisation des ressources et les bonnes pratiques pour un numérique plus responsable."
    },
    {
      "id": 16,
      "titre": "Database 2: Security and Automation",
      "module": "TI603I-2526PSP01",
      "image": "database.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Sécuriser et automatiser les bases de données.",
      "description_longue": "Ce cours approfondit les bases de données en abordant la sécurité, les droits d’accès et l’automatisation. Les étudiants apprennent à protéger les données et à améliorer les performances."
    },
    {
      "id": 17,
      "titre": "Web Programming",
      "module": "ST2WP-2526PSA01",
      "image": "web.png",
      "intervenant": "Equipe pédagogique EFREI",
      "image_prof": "../img/prof/pasdephoto.png",
      "description_courte": "Développer des applications web.",
      "description_longue": "Ce cours permet de consolider les compétences en programmation web. Les étudiants travaillent sur des projets pratiques intégrant HTML, CSS, JavaScript et des interactions client-serveur."
    }
  ]
}